# numpy(6월 24일)

In [2]:
import numpy as np

In [3]:
a = np.array([1,2,3,4])
a

array([1, 2, 3, 4])

In [4]:
type(a)

numpy.ndarray

In [6]:
max([1,2,3,4])

4

In [9]:
a.shape  # 1차원적인거구나

(4,)

In [11]:
a = np.array( [[1,2],[3,4]])

In [17]:
a.shape  #2*2 형태이구나

(2, 3)

In [14]:
a

array([[1, 2],
       [3, 4]])

In [15]:
a = np.array( [[1,2,3],[3,4,5]])
a

array([[1, 2, 3],
       [3, 4, 5]])

In [16]:
a.shape #2*3 형태이구나

(2, 3)

In [24]:
a = np.array([[[1,2,3],[3,4,5]],   [[5,6,7],[7,8,9]]])
a

array([[[1, 2, 3],
        [3, 4, 5]],

       [[5, 6, 7],
        [7, 8, 9]]])

In [26]:
a.shape # 3차원 적인거 (2*2*3)구조  z(높이),y(세로),x(가로)

(2, 2, 3)

In [27]:
# 2차원 배열 만들기
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [28]:
np.arange(10).reshape(2,5)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [29]:
np.arange(12).reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [34]:
np.arange(12).reshape(4,3)

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [36]:
np.arange(24).reshape(4,3,2)

array([[[ 0,  1],
        [ 2,  3],
        [ 4,  5]],

       [[ 6,  7],
        [ 8,  9],
        [10, 11]],

       [[12, 13],
        [14, 15],
        [16, 17]],

       [[18, 19],
        [20, 21],
        [22, 23]]])

In [38]:
np.arange(36).reshape(3,4,3)

array([[[ 0,  1,  2],
        [ 3,  4,  5],
        [ 6,  7,  8],
        [ 9, 10, 11]],

       [[12, 13, 14],
        [15, 16, 17],
        [18, 19, 20],
        [21, 22, 23]],

       [[24, 25, 26],
        [27, 28, 29],
        [30, 31, 32],
        [33, 34, 35]]])

In [42]:
# (element-wise 원소들 끼리끼리 더해진다. row-wise=로우 끼리끼리, column-wise = 컬럼끼리끼리
a = np.array([1,2,3,4])  
b = np.array([5,6,7,8])
a+b

array([ 6,  8, 10, 12])

In [44]:
c = np.array([10])  #모든 a의 수에 다 더해버림
a+c

array([11, 12, 13, 14])

In [47]:
li = [1,2,3,4,5]
li2 = np.array([2])
list(map(lambda x : 2*x, li))

[2, 4, 6, 8, 10]

In [51]:
li2*li

array([ 2,  4,  6,  8, 10])

In [52]:
ar= np.array([1,2,3,4,5])
ar*2

array([ 2,  4,  6,  8, 10])

In [53]:
ar+1

array([2, 3, 4, 5, 6])

In [54]:
a = np.arange(1,5).reshape(2,2)
b = np.arange(5,9).reshape(2,2)

In [55]:
a + b

array([[ 6,  8],
       [10, 12]])

In [56]:
a

array([[1, 2],
       [3, 4]])

In [57]:
b

array([[5, 6],
       [7, 8]])

In [58]:
a*b

array([[ 5, 12],
       [21, 32]])

In [63]:
a@b
a.dot(b)
np.dot(a,b)
np.matmul(a,b)

array([[19, 22],
       [43, 50]])

In [62]:
# 곱한결과 숫자로만 나오면 백터에서는 내적이락 한다.  행과 열의 곱셈

In [ ]:
(1,2) (3
      4)

In [66]:
np.ones((3,3),int)

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

In [69]:
d= np.identity(4)
d

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [71]:
np.eye(4,4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [72]:
a

array([[1, 2],
       [3, 4]])

In [73]:
a.T

array([[1, 3],
       [2, 4]])

In [74]:
t=np.array([1,2])
t.T

array([1, 2])

In [77]:
a = np.array([1,2,3,4])
b = np.array([4,3,2,1])

In [78]:
a>b

array([False, False,  True,  True])

In [79]:
a > 3

array([False, False, False,  True])

In [82]:
a[a > 1]

array([2, 3, 4])

In [88]:
np.sort(b)  # 결과물 보여주는거 View 실제로 바뀌지는 않음

array([1, 2, 3, 4])

In [85]:
a= np.array([3,4,2,1,6,5])
np.sort(a)

array([1, 2, 3, 4, 5, 6])

In [87]:
a

array([3, 4, 2, 1, 6, 5])

In [91]:
a.sort()
a

array([1, 2, 3, 4, 5, 6])

In [92]:
a[::-1]

array([6, 5, 4, 3, 2, 1])

In [93]:
a = np.array([[2,1,6],[0,7,4],[5,3,2]])
a

array([[2, 1, 6],
       [0, 7, 4],
       [5, 3, 2]])

In [94]:
np.sort(a,axis = 0)

array([[0, 1, 2],
       [2, 3, 4],
       [5, 7, 6]])

In [97]:
a = np.array([[2,1,6],[0,7,4],[5,13,2]])

In [98]:
np.sort(a,axis = 0)  # 축! 열로 정려함 세로 기준으로

array([[ 0,  1,  2],
       [ 2,  7,  4],
       [ 5, 13,  6]])

In [99]:
np.sort(a,axis = 1)

array([[ 1,  2,  6],
       [ 0,  4,  7],
       [ 2,  5, 13]])

In [103]:
a = np.array([[2,1,6],[0,7,4],[5,3,2]])  # 인덱싱을 사용하여 바꾸기
a[1,2]=14
a

array([[ 2,  1,  6],
       [ 0,  7, 14],
       [ 5,  3,  2]])

In [108]:
a=np.ones((2,2),int)

In [109]:
a

array([[1, 1],
       [1, 1]])

In [112]:
a = np.ones((2,2))*7
a

array([[7., 7.],
       [7., 7.]])

In [113]:
np.full((2,2),7)

array([[7, 7],
       [7, 7]])

In [126]:
a = np.arange(25).reshape(5,5)  # 슬라이싱해서 원하는거 찾기
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [125]:
yellow = a[4:]
red = a[:,1::2]
blue = a[1::2,0:3:2]
yellow
red
blue

array([[ 5,  7],
       [15, 17]])

In [130]:
a = np.array([0,10,20,30,40,50,60,70])  # Boolean으로 찾기
mask = np.array([0,1,1,0,0,1,0,0],bool)
mask

array([False,  True,  True, False, False,  True, False, False])

In [131]:
a[mask]

array([10, 20, 50])

In [132]:
a>40

array([False, False, False, False, False,  True,  True,  True])

In [133]:
a[a>40]

array([50, 60, 70])

In [135]:
a= np.arange(12).reshape(3,4)
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [137]:
a[[0,1,2,2],[1,2,0,3]]   #2차원 팬시 인덱싱 (앞에는 열 뒤에는 형)

array([ 1,  6,  8, 11])

In [140]:
a=np.arange(25).reshape(5,5)
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [143]:
blue = a[[0,1,2,3],[1,2,3,4]]
blue

array([ 1,  7, 13, 19])

In [144]:
a[range(4), range(1, 5)]

array([ 1,  7, 13, 19])

In [145]:
# 브로드캐스팅

In [146]:
a = np.array([[1,2,3],[4,5,6]])
a

array([[1, 2, 3],
       [4, 5, 6]])

In [159]:
np.sum(a,axis=0)  # 행끼리(세로)

array([5, 7, 9])

In [158]:
np.sum(a,axis=1)  # 열끼리(가로)

array([ 6, 15])

In [148]:
np.sum(a)

21

In [161]:
np.argmin(a)  #최소가 나오게하는 // 한줄로 봤을때 최소값의 인덱스

0

In [162]:
np.argmax(a)  #최대가 나오게하는 x 값 // 한줄로 봤을때 최대값의 인덱스

5

In [163]:
np.mean(a)

3.5

In [170]:
#where
a = np.array([[1,2,3],[4,5,6]])
a
np.where(a>4)   # return index

(array([1, 1], dtype=int64), array([1, 2], dtype=int64))

In [172]:
a[np.where(a>4)]

array([5, 6])

In [173]:
# ndim 몇차원인지

In [174]:
# vstact , hstact  가로냐 새로로 쌓느냐

In [175]:
#A[1:3,::3]  01234
56789
10,11,12,13,14,
15,16,17,18,19
20,21,22,23,24

(20, 21, 22, 23, 24)

In [177]:
np.arange(36).reshape(3,4,3)

array([[[ 0,  1,  2],
        [ 3,  4,  5],
        [ 6,  7,  8],
        [ 9, 10, 11]],

       [[12, 13, 14],
        [15, 16, 17],
        [18, 19, 20],
        [21, 22, 23]],

       [[24, 25, 26],
        [27, 28, 29],
        [30, 31, 32],
        [33, 34, 35]]])

In [179]:
from datetime import datetime, date, time

In [182]:
dt = datetime.now()
dt

datetime.datetime(2022, 6, 24, 16, 26, 44, 748188)

In [187]:
print(dt.year)
print(dt.month)
print(dt.day)
print(dt.hour)

2022
6
24
16

In [188]:
dt.date()

datetime.date(2022, 6, 24)

In [189]:
dt.time()

datetime.time(16, 26, 44, 748188)

In [190]:
dt

datetime.datetime(2022, 6, 24, 16, 26, 44, 748188)

In [192]:
dt.strftime("%m/%d/%Y %H:%M:%S")

#10/29/2011 20:30

'06/24/2022 16:26:44'

In [211]:
dt2 = datetime.strptime('2009/10/31',"%Y/%m/%d") #스트링을 객체로 바꿈
dt2

datetime.datetime(2009, 10, 31, 0, 0)

In [212]:
dt = datetime.now()
dt

datetime.datetime(2022, 6, 24, 16, 37, 19, 986042)

In [209]:
td = dt-dt2  # timedelta 객체
td

datetime.timedelta(days=4619, seconds=59831, microseconds=834203)

In [214]:
dt2+td

datetime.datetime(2022, 6, 24, 16, 37, 11, 834203)

In [215]:
# 올해 크리스마스까지 남은 날짜는 며칠입니까?

In [223]:
dt = datetime.now()
dtc = datetime.strptime('2022/12/25',"%Y/%m/%d")
tda=dtc-dt
tda

datetime.timedelta(days=183, seconds=25743, microseconds=858318)

In [221]:
# p424

# Series

In [1]:
import pandas as pd

In [4]:
s = pd.Series(["a","b","c"])  # 1차원 자료를 시리즈라 한다

In [6]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
s.values

array(['a', 'b', 'c'], dtype=object)

In [14]:
s  # 판다스에서 글자는 오브젝트다

0    a
1    b
2    c
dtype: object

In [12]:
sdata = {"Ohio":35000,"Texas":71000}
s1 = pd.Series(sdata)

In [13]:
type(s1)

pandas.core.series.Series

In [16]:
s1

Ohio     35000
Texas    71000
dtype: int64

In [20]:
s1.index  # 글자도 인덱스가 될수 있다.

Index(['Ohio', 'Texas'], dtype='object')

In [21]:
s1['Ohio']   # 글자도 인덱스가 될수 있다.

35000

## DataFrame(표)

In [23]:
pd.DataFrame([[1,2],[3,4]]) #세로가 인덱스 가로는 칼럼(columns)

   0  1
0  1  2
1  3  4

In [24]:
pd.DataFrame([[1,2],[3,4]], index = ["a","b"])

   0  1
a  1  2
b  3  4

In [26]:
pd.DataFrame([[1,2],[3,4]], index = ["a","b"], columns = ["A","B"])

   A  B
a  1  2
b  3  4

In [27]:
pd.DataFrame([{"key1":1,"key2":2}])

   key1  key2
0     1     2

In [30]:
pd.DataFrame([{"key1":[1,3],"key2":[2,4]}])

     key1    key2
0  [1, 3]  [2, 4]

In [31]:
pd.DataFrame({"key1":[1,3],"key2":[2,4]}) # 키값이 칼럼의 이름으로 간다(딕셔너리 경우)

   key1  key2
0     1     2
1     3     4

In [32]:
pd.DataFrame({"key1":[1,3],"key2":[2,4]}, index = ["a","b"])

   key1  key2
a     1     2
b     3     4

## 판다스 (6월28일)

- 판다스는 구조화된 데이터 형식을 제공. 시리즈는 1차원 배열, 데이터프레임은 2차원 배열
- 라이브러리는 여러 종류의 class와 다양한 내장 함수로 구성. 시리즈와 데이터프레임은 대표적인 클래스 객체임
- 시리즈 인덱스는 데이터 값과 일대일 대응. 파이썬 딕셔너리와 비슷한 구조
- contents
  - Series(변환, 인덱스 구조, 원소 선택)
  - DataFrame(변환, 행인덱스/열이름 지정, 삭제, 선택, 추가, 변경, 전치, 인덱스 활용)

In [4]:
# 딕셔너리를 시리즈로 변환

In [3]:
import pandas as pd

dict_data = {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)

print(sr)
print(type(sr))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
# 리스트를 시리즈로 변환
list_data = ['2019-07-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data, index = list('abcde'))
sr

a    2019-07-02
b          3.14
c           ABC
d           100
e          True
dtype: object

In [6]:
# 인텍스 및 값
idx = sr.index
val = sr.values
print(idx)
print(val)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
['2019-07-02' 3.14 'ABC' 100 True]

In [7]:
# 튜플을 시리즈로 변환
tup_data = ('kevin', '2019-07-02', '남', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

print(sr[0])
print(sr['이름'])
print(sr[[1,2]])

이름           kevin
생년월일    2019-07-02
성별               남
학생여부          True
dtype: object
kevin
kevin
생년월일    2019-07-02
성별               남
dtype: object

In [8]:
import numpy as np
data = np.arange(1000, 5000, 1000)
state = ['Califonia', 'Ohio', 'Oregon', 'Texas']
obj = pd.Series(data, index=state)
obj

obj.name = 'population'
obj.index.name = 'state'
obj

obj.Califonia = np.nan
obj

obj.isnull().sum()

1

## 데이터프레임
- 2차원 배열, R의 데이터프레임에서 유래
- 열은 각각 시리즈 객체
- 시리즈를 열벡터라고 하면 데이터프레임은 여러개의 열벡터들이 같은 행 인덱스를 기준으로 줄이저 결합된 2차원 벡터 또는 행렬
- 선형대수학에서 열 벡터(m X 1행렬)는 m 원소들의 단일 열 행렬
- 행 벡터(1 X m 행렬)은 m원소들의 단일 행 행렬
- 리스트, 딕셔너리, ndarray 등 다양한 데이터로부터 생성
- 반대로 시르트, 딕셔너리, ndarray 등으로 변환될 수 있음

In [9]:
# 배열을 데이터프레임으로 변환
np.random.seed(0)
data = np.random.randint(100,120,size=(3,3))
print(data, type(data))

[[112 115 100]
 [103 103 107]
 [109 119 118]] <class 'numpy.ndarray'>

In [10]:
# numpy의 배열을 ndarray라고 부른다.

df = pd.DataFrame(data, index=['d1','d2','d3'],
                 columns = ['pd','sales','inv'])
df

     pd  sales  inv
d1  112    115  100
d2  103    103  107
d3  109    119  118

In [11]:
# 인덱싱 : iloc 정수 인덱스, loc 이름 인덱스
print(df.iloc[1],'\n')
print(df.loc['d2'])

pd       103
sales    103
inv      107
Name: d2, dtype: int32

pd       103
sales    103
inv      107
Name: d2, dtype: int32

In [12]:
# Q. iloc, loc를 사용하여 107을 출력하세요.
print(df.iloc[1][2])
print(df.loc['d2', 'inv'])

df1 = df.copy()
df1

107
107

     pd  sales  inv
d1  112    115  100
d2  103    103  107
d3  109    119  118

In [13]:
# d3의 값들을 모두 0으로 만드세요.
df1.loc['d3'] = 0
df1

     pd  sales  inv
d1  112    115  100
d2  103    103  107
d3    0      0    0

In [14]:
# 값들이 모두 0인 d4 행을 추가하세요
df1.loc['d4'] = 0
df1

     pd  sales  inv
d1  112    115  100
d2  103    103  107
d3    0      0    0
d4    0      0    0

In [15]:
# 1행 1열의 값을 0으로 만드세요
df1.iloc[1,1] = 0
df1

     pd  sales  inv
d1  112    115  100
d2  103      0  107
d3    0      0    0
d4    0      0    0

In [16]:
# id, gender, age, region
id = np.arange(1,1001)
li = pd.Series(id)
gender = np.random.randint(2,size=1000)
g1 = pd.Series(gender)
age = np.random.randint(1,101,size=1000)
a1 = pd.Series(age)
rengion = np.random.randint(1,11,size=1000)
r1 = pd.Series(rengion)

df1 = pd.concat([li,g1,a1,r1], axis=1)
df1.rename(columns={0:'id',1:'gender',2:'age',3:'region'}, inplace=True)
df1.head()

   id  gender  age  region
0   1       0   11      10
1   2       1   68      10
2   3       0    7       7
3   4       0   92      10
4   5       0  100      10

In [17]:
#과제 : df1에 적학한 컬럼 5개를 추가하여 의미있는 데이터셋을 만드시고 그 데이터 셋의 가치를 설명하세요
df2 = df1.copy()
df2.head()

df2.loc[0:1]=np.nan
df2.head()

df2.isnull().sum()

df2.isnull().sum().sum()

8

In [18]:
# 1 ~ 4중 랜덤한 숫자로 구성되는 10행 5열 2차원 배열을 생성
np.random.seed(1)
data = np.random.randint(1,5, size=(10,5))
print(data,type(data))

[[2 4 1 1 4]
 [2 4 2 4 1]
 [1 2 1 4 2]
 [1 3 2 3 1]
 [3 2 3 1 4]
 [1 3 1 2 3]
 [3 1 4 4 2]
 [2 4 3 1 3]
 [2 2 2 4 4]
 [2 3 2 2 1]] <class 'numpy.ndarray'>

In [19]:
# 배열을 리스트로 변환
list1 = data.tolist()
print(list1,type(list1))

[[2, 4, 1, 1, 4], [2, 4, 2, 4, 1], [1, 2, 1, 4, 2], [1, 3, 2, 3, 1], [3, 2, 3, 1, 4], [1, 3, 1, 2, 3], [3, 1, 4, 4, 2], [2, 4, 3, 1, 3], [2, 2, 2, 4, 4], [2, 3, 2, 2, 1]] <class 'list'>

In [21]:
# 데이터프레임을 배열, 리스트, 딕셔너리로 변환
ar = df1.values
print(ar,type(ar))

[[   1    0   11   10]
 [   2    1   68   10]
 [   3    0    7    7]
 ...
 [ 998    1   40    6]
 [ 999    0   80    7]
 [1000    0   80    5]] <class 'numpy.ndarray'>

In [24]:
li=ar.tolist()
print(li,type(li),'\n')
dict = df1.to_dict('list')
print(dict,type(dict))

[[1, 0, 11, 10], [2, 1, 68, 10], [3, 0, 7, 7], [4, 0, 92, 10], [5, 0, 100, 10], [6, 0, 58, 4], [7, 0, 71, 10], [8, 1, 20, 4], [9, 0, 35, 8], [10, 1, 51, 3], [11, 1, 21, 9], [12, 0, 44, 2], [13, 0, 1, 4], [14, 1, 67, 3], [15, 1, 98, 2], [16, 1, 13, 8], [17, 1, 16, 9], [18, 0, 34, 8], [19, 1, 24, 6], [20, 0, 13, 8], [21, 1, 6, 8], [22, 0, 39, 2], [23, 1, 2, 6], [24, 1, 11, 7], [25, 0, 7, 6], [26, 1, 7, 9], [27, 1, 39, 9], [28, 0, 76, 2], [29, 0, 86, 6], [30, 1, 51, 3], [31, 0, 52, 10], [32, 1, 3, 6], [33, 1, 77, 2], [34, 1, 30, 9], [35, 1, 10, 2], [36, 1, 73, 8], [37, 0, 6, 9], [38, 1, 54, 6], [39, 0, 66, 1], [40, 1, 44, 2], [41, 1, 80, 10], [42, 1, 63, 6], [43, 1, 77, 2], [44, 0, 48, 5], [45, 1, 77, 10], [46, 0, 22, 9], [47, 0, 19, 3], [48, 1, 90, 9], [49, 1, 14, 4], [50, 0, 95, 4], [51, 1, 93, 8], [52, 0, 86, 5], [53, 1, 7, 9], [54, 0, 49, 4], [55, 0, 41, 4], [56, 0, 27, 2], [57, 0, 31, 8], [58, 0, 6, 6], [59, 1, 16, 6], [60, 1, 64, 8], [61, 0, 38, 8], [62, 0, 60, 4], [63, 0, 96, 3], [64, 1, 97, 2], [65, 1, 81, 3], [66, 0, 33, 10], [67, 1, 63, 6], [68, 0, 11, 9], [69, 0, 13, 9], [70, 1, 94, 9], [71, 0, 65, 3], [72, 1, 30, 3], [73, 1, 91, 9], [74, 1, 23, 5], [75, 1, 20, 2], [76, 1, 6, 2], [77, 1, 37, 1], [78, 0, 84, 3], [79, 1, 6, 2], [80, 1, 93, 8], [81, 0, 77, 1], [82, 0, 27, 3], [83, 1, 84, 10], [84, 0, 13, 4], [85, 0, 8, 5], [86, 1, 53, 10], [87, 1, 81, 4], [88, 0, 30, 1], [89, 1, 1, 1], [90, 0, 88, 7], [91, 0, 80, 5], [92, 1, 75, 4], [93, 0, 4, 4], [94, 0, 62, 2], [95, 0, 68, 1], [96, 1, 17, 8], [97, 1, 74, 9], [98, 0, 85, 7], [99, 1, 57, 3], [100, 0, 63, 9], [101, 0, 57, 9], [102, 0, 49, 10], [103, 0, 18, 7], [104, 0, 58, 5], [105, 1, 10, 2], [106, 0, 63, 9], [107, 1, 80, 6], [108, 0, 79, 5], [109, 1, 34, 4], [110, 1, 5, 6], [111, 1, 17, 8], [112, 1, 72, 7], [113, 1, 63, 7], [114, 0, 24, 10], [115, 1, 92, 4], [116, 1, 8, 4], [117, 1, 23, 3], [118, 1, 99, 8], [119, 0, 31, 4], [120, 1, 81, 10], [121, 1, 28, 10], [122, 0, 48, 6], [123, 0, 12, 10], [124, 1, 88, 9], [125, 0, 79, 4], [126, 0, 31, 9], [127, 0, 91, 6], [128, 0, 35, 10], [129, 1, 55, 1], [130, 1, 82, 8], [131, 0, 36, 1], [132, 0, 72, 2], [133, 1, 60, 7], [134, 0, 38, 7], [135, 1, 69, 5], [136, 1, 54, 6], [137, 1, 14, 8], [138, 1, 20, 7], [139, 0, 9, 1], [140, 0, 97, 2], [141, 0, 82, 7], [142, 1, 70, 7], [143, 0, 2, 5], [144, 1, 30, 3], [145, 1, 6, 3], [146, 1, 81, 5], [147, 0, 41, 5], [148, 1, 23, 4], [149, 0, 31, 2], [150, 0, 20, 1], [151, 1, 5, 7], [152, 0, 21, 7], [153, 1, 75, 1], [154, 1, 68, 10], [155, 0, 87, 9], [156, 0, 61, 10], [157, 1, 94, 6], [158, 0, 42, 3], [159, 1, 41, 10], [160, 0, 61, 9], [161, 1, 82, 5], [162, 0, 52, 5], [163, 1, 41, 1], [164, 0, 60, 3], [165, 1, 95, 6], [166, 0, 30, 8], [167, 0, 98, 8], [168, 0, 95, 2], [169, 1, 38, 4], [170, 0, 89, 3], [171, 1, 17, 1], [172, 0, 100, 4], [173, 1, 40, 3], [174, 0, 30, 3], [175, 0, 66, 3], [176, 0, 24, 4], [177, 0, 73, 6], [178, 0, 1, 2], [179, 1, 88, 8], [180, 0, 38, 6], [181, 0, 64, 4], [182, 1, 27, 10], [183, 0, 90, 4], [184, 0, 90, 1], [185, 0, 7, 7], [186, 1, 89, 4], [187, 0, 80, 7], [188, 0, 42, 10], [189, 1, 18, 6], [190, 0, 81, 2], [191, 1, 44, 10], [192, 0, 70, 4], [193, 0, 20, 4], [194, 1, 23, 10], [195, 1, 12, 8], [196, 0, 12, 9], [197, 0, 34, 5], [198, 0, 8, 8], [199, 1, 27, 9], [200, 1, 49, 10], [201, 0, 72, 5], [202, 0, 55, 2], [203, 0, 97, 6], [204, 0, 83, 1], [205, 0, 88, 4], [206, 1, 22, 7], [207, 0, 3, 4], [208, 1, 9, 1], [209, 0, 11, 4], [210, 0, 6, 7], [211, 0, 39, 10], [212, 1, 39, 6], [213, 1, 66, 2], [214, 1, 60, 8], [215, 0, 37, 4], [216, 0, 6, 5], [217, 1, 6, 8], [218, 1, 39, 1], [219, 1, 36, 4], [220, 1, 89, 6], [221, 0, 50, 7], [222, 0, 80, 7], [223, 0, 85, 8], [224, 1, 10, 5], [225, 1, 5, 8], [226, 0, 50, 3], [227, 1, 25, 1], [228, 0, 95, 2], [229, 0, 3, 7], [230, 1, 84, 6], [231, 0, 4, 10], [232, 1, 78, 5], [233, 1, 12, 9], [234, 1, 14, 8], [235, 1, 82, 9], [236, 0, 27, 7], [237, 0, 71, 2], [238, 0, 48, 5], [239, 1, 99, 9], [240, 1, 22, 6], [241, 1, 21, 2], [242, 0, 43, 7], [243, 1, 58, 3], [244, 1, 18, 8], [245, 1, 90, 6], [246, 1, 86, 8], [247, 0, 56, 10], [248, 0, 69, 7], [249, 1, 99, 7], [250, 1, 12, 4], [251, 0, 99, 10], [252, 0, 98, 10], [253, 0, 20, 4], [254, 1, 12, 5], [255, 1, 98, 5], [256, 0, 26, 2], [257, 1, 98, 4], [258, 1, 96, 10], [259, 1, 46, 6], [260, 1, 7, 2], [261, 1, 90, 10], [262, 0, 89, 8], [263, 0, 39, 6], [264, 0, 52, 5], [265, 1, 17, 3], [266, 0, 24, 1], [267, 1, 91, 9], [268, 0, 4, 8], [269, 1, 91, 2], [270, 1, 47, 2], [271, 0, 30, 2], [272, 0, 3, 10], [273, 0, 6, 8], [274, 1, 72, 5], [275, 0, 16, 9], [276, 0, 79, 7], [277, 1, 36, 2], [278, 1, 53, 3], [279, 1, 8, 9], [280, 1, 52, 5], [281, 0, 52, 8], [282, 1, 30, 10], [283, 0, 56, 9], [284, 0, 12, 9], [285, 0, 68, 4], [286, 0, 78, 3], [287, 1, 56, 6], [288, 1, 89, 7], [289, 1, 69, 5], [290, 0, 87, 6], [291, 1, 58, 8], [292, 0, 94, 10], [293, 0, 12, 1], [294, 1, 79, 4], [295, 1, 83, 6], [296, 1, 90, 6], [297, 1, 4, 8], [298, 1, 38, 9], [299, 1, 8, 1], [300, 0, 30, 3], [301, 0, 79, 7], [302, 1, 12, 6], [303, 1, 74, 2], [304, 1, 12, 6], [305, 1, 17, 2], [306, 1, 61, 10], [307, 1, 64, 3], [308, 1, 60, 4], [309, 1, 2, 1], [310, 1, 19, 4], [311, 1, 54, 1], [312, 0, 29, 2], [313, 0, 65, 3], [314, 0, 86, 3], [315, 0, 89, 4], [316, 1, 74, 5], [317, 1, 9, 6], [318, 1, 83, 9], [319, 0, 12, 6], [320, 1, 93, 2], [321, 1, 52, 7], [322, 1, 82, 2], [323, 1, 56, 10], [324, 1, 16, 7], [325, 1, 4, 2], [326, 1, 89, 6], [327, 0, 86, 7], [328, 0, 29, 3], [329, 0, 59, 3], [330, 0, 86, 10], [331, 1, 79, 3], [332, 1, 66, 9], [333, 0, 77, 7], [334, 1, 12, 4], [335, 0, 26, 5], [336, 0, 12, 2], [337, 1, 91, 7], [338, 0, 35, 7], [339, 1, 2, 9], [340, 0, 17, 9], [341, 1, 2, 9], [342, 0, 17, 6], [343, 0, 34, 3], [344, 0, 34, 3], [345, 0, 45, 6], [346, 1, 41, 10], [347, 1, 73, 6], [348, 1, 78, 5], [349, 0, 84, 2], [350, 1, 33, 2], [351, 0, 24, 9], [352, 1, 69, 9], [353, 0, 32, 4], [354, 0, 23, 1], [355, 0, 65, 10], [356, 0, 32, 3], [357, 1, 80, 10], [358, 1, 84, 4], [359, 1, 16, 7], [360, 0, 52, 5], [361, 1, 13, 8], [362, 0, 46, 6], [363, 0, 11, 6], [364, 1, 81, 4], [365, 1, 71, 9], [366, 1, 22, 8], [367, 0, 95, 2], [368, 1, 68, 8], [369, 1, 81, 6], [370, 0, 65, 5], [371, 1, 2, 1], [372, 0, 51, 6], [373, 1, 97, 8], [374, 1, 83, 9], [375, 0, 83, 2], [376, 0, 58, 7], [377, 1, 23, 7], [378, 1, 16, 10], [379, 0, 16, 1], [380, 1, 29, 3], [381, 1, 72, 9], [382, 1, 28, 7], [383, 1, 89, 7], [384, 1, 58, 4], [385, 1, 59, 5], [386, 0, 89, 5], [387, 0, 77, 5], [388, 1, 14, 2], [389, 0, 19, 5], [390, 1, 79, 4], [391, 0, 79, 9], [392, 0, 21, 10], [393, 1, 72, 3], [394, 1, 56, 2], [395, 1, 45, 8], [396, 1, 92, 9], [397, 1, 45, 4], [398, 0, 16, 4], [399, 1, 88, 10], [400, 1, 76, 1], [401, 1, 78, 8], [402, 0, 30, 8], [403, 0, 96, 6], [404, 1, 83, 4], [405, 1, 5, 8], [406, 0, 29, 9], [407, 1, 66, 6], [408, 1, 50, 6], [409, 1, 50, 2], [410, 0, 88, 8], [411, 0, 58, 7], [412, 0, 81, 2], [413, 1, 42, 9], [414, 0, 91, 2], [415, 0, 67, 3], [416, 0, 48, 1], [417, 0, 18, 3], [418, 0, 21, 5], [419, 0, 39, 5], [420, 1, 65, 9], [421, 1, 7, 5], [422, 1, 23, 8], [423, 0, 80, 6], [424, 0, 75, 3], [425, 1, 35, 4], [426, 1, 41, 1], [427, 1, 39, 8], [428, 0, 22, 10], [429, 1, 35, 7], [430, 0, 33, 10], [431, 1, 43, 9], [432, 0, 45, 2], [433, 1, 100, 8], [434, 1, 42, 7], [435, 1, 28, 9], [436, 0, 49, 5], [437, 1, 11, 4], [438, 0, 69, 6], [439, 0, 18, 3], [440, 1, 4, 1], [441, 0, 95, 2], [442, 1, 88, 5], [443, 0, 30, 1], [444, 0, 31, 6], [445, 1, 76, 9], [446, 0, 67, 4], [447, 0, 94, 10], [448, 0, 61, 2], [449, 0, 8, 6], [450, 0, 52, 10], [451, 0, 74, 1], [452, 0, 88, 9], [453, 0, 65, 2], [454, 0, 18, 7], [455, 1, 41, 10], [456, 0, 22, 8], [457, 1, 95, 2], [458, 1, 27, 5], [459, 0, 16, 10], [460, 1, 18, 9], [461, 1, 11, 7], [462, 1, 18, 8], [463, 0, 4, 6], [464, 0, 74, 8], [465, 1, 30, 9], [466, 1, 68, 6], [467, 1, 72, 2], [468, 1, 81, 5], [469, 0, 99, 8], [470, 1, 5, 9], [471, 0, 62, 8], [472, 1, 91, 8], [473, 0, 7, 10], [474, 0, 33, 10], [475, 0, 82, 1], [476, 0, 38, 7], [477, 1, 28, 4], [478, 1, 52, 8], [479, 1, 79, 3], [480, 1, 60, 7], [481, 1, 87, 4], [482, 0, 96, 6], [483, 1, 9, 9], [484, 0, 57, 10], [485, 1, 30, 6], [486, 0, 29, 1], [487, 1, 96, 7], [488, 0, 35, 10], [489, 1, 59, 2], [490, 1, 82, 5], [491, 0, 93, 8], [492, 0, 17, 6], [493, 0, 73, 3], [494, 1, 60, 7], [495, 1, 8, 5], [496, 1, 13, 8], [497, 0, 33, 4], [498, 0, 85, 7], [499, 1, 76, 8], [500, 0, 94, 1], [501, 0, 41, 7], [502, 1, 1, 5], [503, 0, 85, 3], [504, 0, 93, 4], [505, 0, 78, 3], [506, 1, 38, 1], [507, 0, 48, 10], [508, 1, 62, 6], [509, 0, 51, 9], [510, 1, 69, 2], [511, 0, 77, 1], [512, 1, 58, 10], [513, 1, 5, 6], [514, 0, 37, 10], [515, 0, 81, 3], [516, 1, 83, 2], [517, 0, 38, 4], [518, 1, 95, 1], [519, 0, 36, 7], [520, 1, 49, 1], [521, 0, 1, 8], [522, 0, 50, 10], [523, 0, 58, 4], [524, 0, 10, 9], [525, 1, 51, 5], [526, 1, 98, 5], [527, 0, 49, 6], [528, 1, 13, 2], [529, 0, 71, 7], [530, 1, 37, 9], [531, 1, 100, 7], [532, 0, 37, 2], [533, 1, 31, 5], [534, 0, 20, 5], [535, 0, 39, 10], [536, 0, 45, 9], [537, 0, 36, 7], [538, 0, 15, 3], [539, 1, 30, 4], [540, 1, 52, 9], [541, 0, 61, 1], [542, 0, 82, 6], [543, 0, 68, 9], [544, 0, 30, 8], [545, 1, 28, 6], [546, 1, 4, 7], [547, 0, 34, 6], [548, 0, 52, 8], [549, 1, 28, 5], [550, 0, 57, 3], [551, 1, 22, 7], [552, 1, 40, 7], [553, 1, 75, 9], [554, 1, 30, 2], [555, 1, 30, 1], [556, 1, 62, 6], [557, 1, 59, 1], [558, 1, 25, 2], [559, 1, 17, 5], [560, 1, 65, 2], [561, 1, 99, 10], [562, 0, 14, 1], [563, 0, 2, 4], [564, 1, 3, 10], [565, 1, 67, 4], [566, 1, 20, 1], [567, 1, 77, 9], [568, 0, 31, 3], [569, 0, 40, 6], [570, 1, 86, 5], [571, 0, 78, 3], [572, 0, 50, 5], [573, 1, 27, 3], [574, 0, 13, 1], [575, 1, 65, 2], [576, 0, 2, 6], [577, 1, 37, 6], [578, 0, 11, 9], [579, 0, 33, 1], [580, 1, 29, 1], [581, 0, 59, 6], [582, 0, 67, 8], [583, 0, 93, 4], [584, 0, 66, 7], [585, 0, 78, 1], [586, 1, 84, 3], [587, 0, 48, 1], [588, 1, 82, 6], [589, 0, 37, 2], [590, 0, 72, 8], [591, 1, 54, 4], [592, 1, 71, 3], [593, 1, 10, 4], [594, 1, 16, 3], [595, 0, 19, 4], [596, 0, 30, 8], [597, 1, 54, 8], [598, 0, 61, 2], [599, 1, 43, 5], [600, 1, 83, 7], [601, 1, 3, 8], [602, 1, 30, 1], [603, 0, 18, 1], [604, 0, 36, 7], [605, 1, 20, 5], [606, 0, 17, 5], [607, 0, 24, 6], [608, 1, 13, 2], [609, 1, 100, 3], [610, 1, 57, 7], [611, 0, 67, 9], [612, 0, 21, 3], [613, 0, 4, 10], [614, 1, 82, 10], [615, 1, 45, 6], [616, 0, 39, 6], [617, 1, 43, 9], [618, 0, 75, 6], [619, 0, 38, 10], [620, 0, 41, 2], [621, 1, 28, 10], [622, 1, 5, 5], [623, 0, 52, 7], [624, 1, 23, 10], [625, 0, 38, 9], [626, 1, 36, 1], [627, 0, 31, 6], [628, 0, 8, 7], [629, 1, 89, 1], [630, 0, 89, 7], [631, 0, 16, 1], [632, 0, 11, 7], [633, 0, 20, 8], [634, 0, 78, 2], [635, 1, 57, 2], [636, 1, 19, 6], [637, 1, 72, 1], [638, 1, 61, 7], [639, 1, 25, 5], [640, 1, 33, 5], [641, 1, 40, 5], [642, 1, 17, 8], [643, 0, 53, 3], [644, 0, 91, 2], [645, 0, 81, 5], [646, 0, 47, 10], [647, 1, 97, 9], [648, 1, 95, 5], [649, 1, 85, 5], [650, 1, 24, 8], [651, 0, 16, 1], [652, 1, 45, 8], [653, 0, 84, 9], [654, 0, 56, 10], [655, 1, 99, 10], [656, 1, 28, 6], [657, 1, 46, 3], [658, 0, 99, 7], [659, 1, 82, 10], [660, 1, 88, 6], [661, 1, 28, 7], [662, 0, 78, 6], [663, 1, 49, 4], [664, 1, 88, 4], [665, 1, 95, 1], [666, 1, 6, 4], [667, 1, 98, 5], [668, 0, 99, 2], [669, 0, 29, 1], [670, 1, 66, 10], [671, 0, 69, 10], [672, 0, 86, 4], [673, 0, 73, 10], [674, 1, 34, 4], [675, 0, 100, 5], [676, 1, 49, 7], [677, 0, 100, 6], [678, 1, 90, 8], [679, 0, 70, 2], [680, 1, 66, 6], [681, 1, 100, 8], [682, 0, 72, 7], [683, 1, 2, 7], [684, 0, 2, 7], [685, 0, 72, 2], [686, 0, 26, 9], [687, 1, 78, 5], [688, 0, 51, 3], [689, 1, 28, 1], [690, 0, 97, 3], [691, 1, 44, 9], [692, 1, 20, 4], [693, 0, 99, 8], [694, 1, 46, 3], [695, 1, 81, 2], [696, 0, 44, 5], [697, 1, 68, 5], [698, 1, 9, 5], [699, 1, 84, 3], [700, 1, 47, 5], [701, 1, 65, 9], [702, 0, 21, 8], [703, 0, 97, 10], [704, 1, 99, 9], [705, 1, 6, 10], [706, 1, 86, 6], [707, 1, 25, 10], [708, 0, 3, 2], [709, 1, 72, 9], [710, 0, 76, 9], [711, 0, 29, 7], [712, 1, 96, 1], [713, 0, 66, 1], [714, 1, 81, 3], [715, 0, 83, 4], [716, 1, 15, 3], [717, 1, 22, 2], [718, 0, 70, 10], [719, 1, 34, 6], [720, 1, 3, 7], [721, 0, 28, 2], [722, 1, 20, 9], [723, 0, 16, 8], [724, 0, 72, 8], [725, 0, 30, 4], [726, 0, 36, 5], [727, 1, 98, 10], [728, 0, 49, 7], [729, 0, 50, 10], [730, 1, 81, 7], [731, 0, 57, 5], [732, 0, 64, 2], [733, 0, 89, 3], [734, 1, 59, 1], [735, 0, 6, 1], [736, 1, 52, 8], [737, 0, 62, 7], [738, 0, 84, 3], [739, 0, 18, 10], [740, 0, 46, 9], [741, 1, 97, 9], [742, 1, 63, 3], [743, 1, 23, 2], [744, 0, 98, 3], [745, 0, 10, 8], [746, 1, 6, 7], [747, 1, 77, 7], [748, 0, 62, 3], [749, 1, 43, 2], [750, 1, 17, 6], [751, 0, 60, 7], [752, 1, 18, 10], [753, 1, 69, 10], [754, 0, 61, 4], [755, 1, 26, 10], [756, 0, 15, 5], [757, 1, 62, 3], [758, 1, 54, 2], [759, 0, 82, 7], [760, 0, 30, 1], [761, 0, 71, 3], [762, 0, 29, 7], [763, 1, 75, 4], [764, 1, 6, 8], [765, 0, 85, 6], [766, 0, 56, 3], [767, 1, 51, 7], [768, 1, 87, 7], [769, 0, 54, 2], [770, 0, 11, 10], [771, 0, 44, 1], [772, 1, 60, 2], [773, 0, 31, 4], [774, 1, 60, 4], [775, 0, 15, 2], [776, 0, 49, 4], [777, 1, 57, 5], [778, 0, 66, 4], [779, 0, 8, 10], [780, 0, 70, 10], [781, 1, 16, 6], [782, 1, 53, 7], [783, 0, 33, 9], [784, 0, 88, 10], [785, 0, 79, 6], [786, 1, 35, 6], [787, 0, 30, 9], [788, 0, 52, 5], [789, 1, 90, 6], [790, 0, 54, 1], [791, 1, 5, 4], [792, 0, 65, 2], [793, 0, 27, 7], [794, 1, 85, 9], [795, 1, 6, 7], [796, 0, 89, 4], [797, 0, 18, 5], [798, 1, 69, 6], [799, 1, 57, 9], [800, 1, 33, 3], [801, 0, 82, 10], [802, 0, 73, 4], [803, 0, 74, 3], [804, 0, 32, 10], [805, 0, 95, 2], [806, 1, 74, 2], [807, 0, 49, 9], [808, 0, 100, 7], [809, 0, 33, 4], [810, 0, 15, 3], [811, 0, 62, 3], [812, 1, 88, 5], [813, 1, 33, 8], [814, 1, 57, 3], [815, 1, 29, 5], [816, 1, 44, 5], [817, 0, 98, 10], [818, 0, 51, 2], [819, 1, 47, 6], [820, 1, 73, 4], [821, 1, 38, 8], [822, 1, 3, 5], [823, 1, 18, 3], [824, 1, 16, 1], [825, 1, 68, 10], [826, 1, 86, 3], [827, 0, 94, 3], [828, 0, 23, 10], [829, 0, 83, 7], [830, 1, 8, 9], [831, 1, 56, 10], [832, 1, 50, 2], [833, 1, 27, 2], [834, 0, 5, 2], [835, 0, 90, 1], [836, 1, 27, 2], [837, 0, 61, 8], [838, 1, 84, 1], [839, 1, 79, 7], [840, 1, 19, 6], [841, 1, 97, 10], [842, 1, 92, 9], [843, 0, 37, 6], [844, 0, 21, 7], [845, 0, 4, 9], [846, 0, 19, 2], [847, 1, 78, 5], [848, 0, 52, 6], [849, 0, 50, 10], [850, 0, 32, 1], [851, 0, 98, 6], [852, 1, 19, 7], [853, 1, 13, 10], [854, 1, 92, 2], [855, 1, 99, 2], [856, 1, 72, 4], [857, 0, 95, 2], [858, 1, 46, 7], [859, 0, 81, 1], [860, 0, 66, 8], [861, 1, 89, 7], [862, 1, 17, 5], [863, 1, 46, 10], [864, 1, 92, 3], [865, 1, 38, 4], [866, 0, 51, 7], [867, 0, 25, 7], [868, 1, 49, 3], [869, 0, 77, 2], [870, 0, 5, 8], [871, 1, 52, 9], [872, 1, 47, 9], [873, 1, 41, 5], [874, 0, 15, 3], [875, 0, 11, 10], [876, 1, 28, 9], [877, 1, 79, 1], [878, 0, 14, 4], [879, 0, 5, 1], [880, 0, 87, 6], [881, 1, 16, 8], [882, 1, 30, 8], [883, 0, 79, 5], [884, 1, 43, 9], [885, 0, 26, 3], [886, 1, 76, 10], [887, 0, 96, 6], [888, 1, 92, 2], [889, 1, 23, 8], [890, 1, 44, 8], [891, 1, 85, 2], [892, 0, 56, 6], [893, 0, 3, 1], [894, 0, 26, 8], [895, 1, 1, 9], [896, 1, 96, 5], [897, 1, 57, 6], [898, 1, 71, 3], [899, 0, 83, 1], [900, 0, 87, 9], [901, 0, 63, 7], [902, 0, 47, 6], [903, 0, 90, 4], [904, 0, 78, 9], [905, 1, 13, 10], [906, 1, 63, 1], [907, 0, 38, 8], [908, 1, 84, 3], [909, 0, 32, 9], [910, 0, 29, 8], [911, 1, 60, 7], [912, 0, 84, 1], [913, 1, 41, 6], [914, 0, 90, 3], [915, 0, 30, 7], [916, 0, 29, 9], [917, 0, 53, 5], [918, 1, 43, 1], [919, 0, 11, 4], [920, 0, 85, 5], [921, 1, 18, 2], [922, 1, 1, 9], [923, 0, 40, 3], [924, 0, 39, 9], [925, 1, 99, 10], [926, 0, 66, 9], [927, 1, 49, 8], [928, 0, 87, 10], [929, 1, 46, 4], [930, 0, 50, 7], [931, 1, 23, 4], [932, 1, 93, 8], [933, 1, 66, 8], [934, 0, 86, 3], [935, 1, 67, 8], [936, 0, 33, 9], [937, 1, 51, 5], [938, 1, 71, 4], [939, 0, 36, 1], [940, 0, 24, 3], [941, 0, 83, 6], [942, 1, 90, 5], [943, 1, 80, 3], [944, 0, 28, 8], [945, 0, 86, 4], [946, 0, 2, 8], [947, 0, 10, 4], [948, 0, 82, 2], [949, 0, 12, 5], [950, 1, 65, 6], [951, 0, 68, 4], [952, 0, 62, 3], [953, 0, 55, 2], [954, 0, 37, 4], [955, 1, 85, 5], [956, 0, 20, 5], [957, 0, 70, 7], [958, 0, 85, 10], [959, 1, 63, 10], [960, 1, 69, 4], [961, 0, 42, 8], [962, 1, 81, 5], [963, 0, 17, 1], [964, 0, 58, 1], [965, 0, 6, 1], [966, 1, 97, 1], [967, 0, 23, 5], [968, 0, 4, 6], [969, 0, 9, 6], [970, 1, 63, 10], [971, 1, 93, 3], [972, 1, 42, 1], [973, 0, 75, 8], [974, 0, 93, 2], [975, 1, 96, 10], [976, 0, 12, 10], [977, 1, 35, 1], [978, 1, 92, 8], [979, 0, 50, 7], [980, 0, 72, 8], [981, 0, 40, 10], [982, 0, 59, 1], [983, 0, 6, 10], [984, 0, 74, 5], [985, 0, 89, 9], [986, 0, 13, 6], [987, 1, 98, 3], [988, 0, 60, 6], [989, 1, 79, 5], [990, 0, 16, 2], [991, 1, 5, 1], [992, 0, 23, 3], [993, 0, 53, 6], [994, 0, 67, 5], [995, 1, 72, 3], [996, 0, 73, 8], [997, 1, 6, 4], [998, 1, 40, 6], [999, 0, 80, 7], [1000, 0, 80, 5]] <class 'list'>


In [69]:
# file 생성
import pandas as pd
file_data = pd.DataFrame({
    'col1':[1,2,3,4,5,6],
    'col2':['A','A','B','B','C','C']
})
file_data

   col1 col2
0     1    A
1     2    A
2     3    B
3     4    B
4     5    C
5     6    C

In [82]:
file_data['col3']='e'
file_data

   col1 col2 col3
0     1    A    e
1     2    A    e
2     3    B    e
3     4    B    e
4     5    C    e
5     6    C    e

In [83]:
file_data.to_csv('C:/cakd7/m2_분석라이브러리활용/pandas/dataset/file_data.csv',index=None)

In [84]:
file_data = pd.read_csv('C:/cakd7/m2_분석라이브러리활용/pandas/dataset/file_data.csv')
file_data

   col1 col2 col3
0     1    A    e
1     2    A    e
2     3    B    e
3     4    B    e
4     5    C    e
5     6    C    e

In [85]:
df_1 = pd.DataFrame({
    'col1':np.array([1,2,3]),
    'col2':np.array(['A','B','C'])
})

df_2 = pd.DataFrame({
    'col1':np.array([4,5,6]),
    'col2':np.array(['D','E','F'])
})

df_3 = pd.concat([df_1,df-2],axis=1)  #concat 합치는거
print(df_3,'\n')
df_4 = pd.concat([df_1,df_2])
df_4

    col1 col2     pd  sales    inv
0    1.0    A    NaN    NaN    NaN
1    2.0    B    NaN    NaN    NaN
2    3.0    C    NaN    NaN    NaN
d1   NaN  NaN  110.0  113.0   98.0
d2   NaN  NaN  101.0  101.0  105.0
d3   NaN  NaN  107.0  117.0  116.0

   col1 col2
0     1    A
1     2    B
2     3    C
0     4    D
1     5    E
2     6    F

In [86]:
df_5 = df_4.copy()
df_5 = df_5.drop('col1',axis=1)   #drop = 삭제, axis=1 열방향
df_5

  col2
0    A
1    B
2    C
0    D
1    E
2    F

In [87]:
# 행 삭제
df_6 = df_3.copy()
df_6 = df_6.drop([0])
df_6

    col1 col2     pd  sales    inv
1    2.0    B    NaN    NaN    NaN
2    3.0    C    NaN    NaN    NaN
d1   NaN  NaN  110.0  113.0   98.0
d2   NaN  NaN  101.0  101.0  105.0
d3   NaN  NaN  107.0  117.0  116.0

In [88]:
df1 = file_data.copy()
df1

   col1 col2 col3
0     1    A    e
1     2    A    e
2     3    B    e
3     4    B    e
4     5    C    e
5     6    C    e

In [89]:
df1[3:]

   col1 col2 col3
3     4    B    e
4     5    C    e
5     6    C    e

In [90]:
df1[2:5]

   col1 col2 col3
2     3    B    e
3     4    B    e
4     5    C    e

In [91]:
df1.iloc[-1]

col1    6
col2    C
col3    e
Name: 5, dtype: object

In [92]:
df1

   col1 col2 col3
0     1    A    e
1     2    A    e
2     3    B    e
3     4    B    e
4     5    C    e
5     6    C    e

In [93]:
df1.loc[:,['col1','col2']]  # e두개의칼럼으    df1.loc[1:3,['col1','col2']]

   col1 col2
0     1    A
1     2    A
2     3    B
3     4    B
4     5    C
5     6    C

In [94]:
df1[['col1','col3']]

   col1 col3
0     1    e
1     2    e
2     3    e
3     4    e
4     5    e
5     6    e

In [95]:
df1.iloc[1:3,0:2]

   col1 col2
1     2    A
2     3    B

In [ ]:
# 판다스에서 인덱싱 하는방법 2가지  loc(이름인덱스) ,iloc(정수인덱스)
# 연속된걸 뽑을땐 클론(:),슬라이싱
#

## 6월 29일
- 컬럼하고 인덱스를 바꾸기

In [6]:
import numpy as np
import pandas as pd
np.random.seed(2)
data = np.random.randint(50,100,size=(3,5))
df_e = pd.DataFrame(data,columns=list("abcde"))
df_e

    a   b   c   d   e
0  90  65  95  58  72
1  93  68  61  90  57
2  84  99  81  61  71

In [19]:
df1= df_e.copy()

In [20]:
df1.rename(columns={"a":"국어","b":"영어","c":"수학","d":"과학","e":"음악"},
            index={0:"이상윤",1:"강유한",2:"조승현"},inplace=True)
df1

     국어  영어  수학  과학  음악
이상윤  90  65  95  58  72
강유한  93  68  61  90  57
조승현  84  99  81  61  71

In [56]:
# 8행 5열 데이터프레임 생성
np.random.seed(5)
data = np.random.randint(50,100,size=(8,5))
df = pd.DataFrame(data,columns=list('abcde'))
df

    a   b   c   d   e
0  85  64  97  88  66
1  59  58  86  89  77
2  98  80  66  57  62
3  65  99  89  66  77
4  94  63  61  51  97
5  80  70  72  68  59
6  92  91  91  51  68
7  89  66  64  55  50

In [54]:
# Q. 열이름과 행이름 변경
df.rename(columns={'a':'아반떼','b':'소나타','c':'k5','d':'그랜저','e':'투싼'},
         index={0:10,1:20,2:30,3:40,4:50,5:60,6:70,7:80},inplace=True)
df

    아반떼  소나타  k5  그랜저  투싼
10   85   64  97   88  66
20   59   58  86   89  77
30   98   80  66   57  62
40   65   99  89   66  77
50   94   63  61   51  97
60   80   70  72   68  59
70   92   91  91   51  68
80   89   66  64   55  50

In [37]:
# Q. 3행만 출력
df.iloc[40]
df[3:4]

    아반떼  소나타  k5  그랜저  투싼
40   65   99  89   66  77

In [39]:
df.iloc[2]

아반떼    98
소나타    80
k5     66
그랜저    57
투싼     62
Name: 30, dtype: int32

In [41]:
# Q.3행 5열의 값 출력
df.iloc[2:3,4:5]
df.iloc[2,4]

62

In [44]:
# Q. 4열의 값을 모두 0으로 변경
df.iloc[:,3]=0
df

    아반떼  소나타  k5  그랜저  투싼
10   85   64  97    0  66
20   59   58  86    0  77
30   98   80  66    0  62
40   65   99  89    0  77
50   94   63  61    0  97
60   80   70  72    0  59
70   92   91  91    0  68
80   89   66  64    0  50

In [47]:
# Q. 6행의 2,3,4,열의 값을 조회
df.iloc[5,1:4]

소나타    70
k5     72
그랜저     0
Name: 60, dtype: int64

In [50]:
# Q. 2열을 Series와 DataFrame으로 각각 출력
#df.iloc[:,1]
#df.iloc[:,[1]]

    소나타
10   64
20   58
30   80
40   99
50   63
60   70
70   91
80   66

In [51]:
# Q. 2행 3열의 값을 2행 4열의 값과 동일하게 변경
df.iloc[1,2]=df.iloc[1,3]
df

    아반떼  소나타  k5  그랜저  투싼
10   85   64  97    0  66
20   59   58   0    0  77
30   98   80  66    0  62
40   65   99  89    0  77
50   94   63  61    0  97
60   80   70  72    0  59
70   92   91  91    0  68
80   89   66  64    0  50

In [57]:
df_s=df.copy()
df_s

    a   b   c   d   e
0  85  64  97  88  66
1  59  58  86  89  77
2  98  80  66  57  62
3  65  99  89  66  77
4  94  63  61  51  97
5  80  70  72  68  59
6  92  91  91  51  68
7  89  66  64  55  50

In [58]:
df_s.rename(index={0:'r0',1:'r1',2:'r2',3:'r3',4:'r4',5:'r5',6:'r6',7:'r7'},inplace=True)
df_s

     a   b   c   d   e
r0  85  64  97  88  66
r1  59  58  86  89  77
r2  98  80  66  57  62
r3  65  99  89  66  77
r4  94  63  61  51  97
r5  80  70  72  68  59
r6  92  91  91  51  68
r7  89  66  64  55  50

In [63]:
# 내림차순
#df1_s=df_s.sort_index(ascending=False)
df1_s=df_s.sort_index(ascending=True) #오름차순
df1_s

     a   b   c   d   e
r0  85  64  97  88  66
r1  59  58  86  89  77
r2  98  80  66  57  62
r3  65  99  89  66  77
r4  94  63  61  51  97
r5  80  70  72  68  59
r6  92  91  91  51  68
r7  89  66  64  55  50

In [65]:
# 특정 열 기준으로 정렬
df1_c = df1_s.sort_values(by='c',ascending=False)
df1_c

     a   b   c   d   e
r0  85  64  97  88  66
r6  92  91  91  51  68
r3  65  99  89  66  77
r1  59  58  86  89  77
r5  80  70  72  68  59
r2  98  80  66  57  62
r7  89  66  64  55  50
r4  94  63  61  51  97

In [70]:
# 전치 (행과열의 위치 바꿈(벨류도 같이))
df1_t = df1_s.iloc[:5,:]
df1_t

     a   b   c   d   e
r0  85  64  97  88  66
r1  59  58  86  89  77
r2  98  80  66  57  62
r3  65  99  89  66  77
r4  94  63  61  51  97

In [68]:
df1_t = df1_t.transpose()
df1_t

   r0  r1  r2  r3  r4
a  85  59  98  65  94
b  64  58  80  99  63
c  97  86  66  89  61
d  88  89  57  66  51
e  66  77  62  77  97